[
  {
    "title": "NLM Announces 2025 Michael E. DeBakey Fellows in the History of Medicine",
    "summary": "Following its May 6, 2024, call for applications to the National Library of Medicine (NLM) Michael E. DeBakey Fellowship in the History of Medicine, NLM is pleased to announce its 2025 DeBakey Fellows.",
    "link": "https://www.nlm.nih.gov/news/2025_DeBakey_Fellows_History_of_Medicine.html",
    "published": "Tue, 17 Dec 2024 00:00:00 EST",
    "source": "PubMed",
    "fetched_at": "2025-11-20T15:54:30.270350"
  },
  {
    "title": "Michael Huerta, PhD, Acting Deputy Director for Operations and Innovation at the National Library of Medicine (NLM) Retires",
    "summary": "Michael Huerta, PhD, NLM Deputy Director for Operations and Innovation (Acting), Associate Director for Strategy at the National Institutes of Health (NIH)’s National Library of Medicine (NLM) will retire effective January 11.",
    "link": "https://www.nlm.nih.gov/news/Michael_Huerta_retires.html",
    "published": "Mon, 25 Nov 2024 00:00:00 EST",
    "source": "PubMed",
    "fetched_at": "2025-11-20T15:54:30.270350"
  },
  {
    "title": "NIH-developed AI algorithm matches potential volunteers to clinical trials",
    "summary": "Such an algorithm may save clinicians time and accelerate clinical enrollment and research.",
    "link": "https://www.nlm.nih.gov/news/AI_algorithm_volunteers_clinical_trials.html",
    "published": "Mon, 18 Nov 2024 00:00:00 EST",
    "source": "PubMed",
    "fetched_at": "2025-11-20T15:54:30.270350"
  },
  {
    "title": "NLM and AAHSL Announces 2024-2025 Leadership Fellows and Mentors",
    "summary": "The National Library of Medicine (NLM) and the Association of Academic Health Sciences Libraries (AAHSL) are pleased to announce the members of the 2024-2025 class of the NLM/AAHSL Leadership Fellows Program. The jointly sponsored program matches fellows and mentors in a one-year leadership development program.",
    "link": "https://www.nlm.nih.gov/news/2024-2025_Leadership_Fellows_Mentors.html",
    "published": "Tue, 29 Oct 2024 00:00:00 EST",
    "source": "PubMed",
    "fetched_at": "2025-11-20T15:54:30.270350"
  },
  {
    "title": "NLM Announces New Colloquia on Biomedical Data Science and Computational Biology Research",
    "summary": "The NLM Colloquia on Biomedical Data Science and Computational Biology Research features guest speakers from across the bioinformatics community to present their research and discuss how it contributes to advancing biomedical discovery in these rapidly evolving fields.",
    "link": "https://www.nlm.nih.gov/news/NLM_Colloquia_on_Biomedica_Data_Science_and_Computational_Biology_Research.html",
    "published": "Thu, 10 Oct 2024 10:35:42 EST",
    "source": "PubMed",
    "fetched_at": "2025-11-20T15:54:30.270350"
  }
]